---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoDetailGroups
source: html/f2e031a9-5319-3675-fbfc-3584f9df89b5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoDetailGroups Property

There are no Detail Groups in this Project or Family.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoDetailGroups { get; }
```